Tekla.Structures.Drawing.PropertyElement.PropertyElementType.PartMarkPropertyElementTypes
The PartMarkPropertyElementTypes class represents the available property element types for part marks.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.PartMarkPropertyElementTypes.AssemblyPosition
Returns the assembly position property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.PartMarkPropertyElementTypes.PartPosition
Returns the part position property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.PartMarkPropertyElementTypes.Profile
Returns the profile property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.PartMarkPropertyElementTypes.Material
Returns the material property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.PartMarkPropertyElementTypes.Name
Returns the name property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.PartMarkPropertyElementTypes.Class
Returns the class property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.PartMarkPropertyElementTypes.Finish
Returns the finish property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.PartMarkPropertyElementTypes.Size
Returns the size property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.PartMarkPropertyElementTypes.Length
Returns the length property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.PartMarkPropertyElementTypes.Camber
Returns the camber property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.PartMarkPropertyElementTypes.FittingsNsFs
Returns the fittings (NS/FS) property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.PartMarkPropertyElementTypes.FaceDirection
Returns the face direction property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.PartMarkPropertyElementTypes.GageOfOutstandingLeg
Returns the gage of the outstanding leg property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.PartMarkPropertyElementTypes.CenterToCenterDistance
Returns the center-to-center distance property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.PartMarkPropertyElementTypes.RotationAngle
Returns the rotation angle property element type.
Returns: The requested property element type.